Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.RefreshFile Method
 Reload the reference file from the location specified by Filename. If the file has changed, a new revision will be created and taken into use. Note that if a new revision was successfully created, the ActiveFilePath is changed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RefreshFile()
Public Function RefreshFile As Boolean
Return Value
Type: Boolean
 true if a new revision was added, false if it was not. If false, the file can either be unchanged or there was an error.
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace